<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class InterventionsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //
        /*
            Коррекция ИБС	АКШ
             	Стентирование
             	ТМЛР
             	Стволовые клетки
             	Резекция аневризмы ЛЖ
            Коррекция ВПС	ДМПП (откр)
             	ДМПП (эндо)
             	ДМЖП (откр)
             	ДМЖП (эндо)
             	Протез АК (мех)
             	Протез АК (биол)
             	Пластика АК
             	Протез МК (мех)
             	Протез МК (биол)
             	Пластика МК
             	Протез ТК (мех)
             	Протез ТК (биол)
             	Пластика ТК
             	Коррекция Тетрада Фалло
             	Коррекция ЧАДЛВ
             	Коррекция ТМА
             	Коррекция АВК
             	Коррекция ЧАВК
             	Коррекция ан. Эбштейна
            Коррекция ППС	Протез АК (мех)
             	Протез АК (биол)
             	Пластика АК
             	Протез МК (мех)
             	Протез МК (биол)
             	Пластика МК
             	Протез ТК (мех)
             	Протез ТК (биол)
             	Пластика ТК
             	Протез КЛА
            Коррекция НРС	Лабиринт
             	РЧА ПП
             	РЧА Прав перешейка
             	РЧА ЛП
             	РЧА ЛВ
             	РЧА ПЖ
             	РЧА ЛЖ
             	ЭКС-1-камерный
             	ЭКС-2-камерный
             	ЭКС-3-камерный (БВС)
            Коррекция КМП	Миэктомия
             	Перикардэктомия
            Коррекция периферического атеросклероза	Резекция ВСА
             	ЭАЭ ВСА
             	Стентирование ВСА
             	Стентирование артерий НК
             	Шунтирование артерий НК

        */

        

        $mass[] = ["group"=> "Коррекция ИБС", "name"=> "АКШ", "group_no"=>1, "no"=>1];
        $mass[] = ["group"=> "Коррекция ИБС", "name"=> "Стентирование", "group_no"=>1, "no"=>2];
        $mass[] = ["group"=> "Коррекция ИБС", "name"=> "ТМЛР", "group_no"=>1, "no"=>3];
        $mass[] = ["group"=> "Коррекция ИБС", "name"=> "Стволовые клетки", "group_no"=>1, "no"=>4];
        $mass[] = ["group"=> "Коррекция ИБС", "name"=> "Резекция аневризмы ЛЖ", "group_no"=>1, "no"=>5];
        
        $mass[] = ["group"=> "Коррекция ВПС", "name"=> "ДМПП (откр)", "group_no"=>2, "no"=>6];
        $mass[] = ["group"=> "Коррекция ВПС", "name"=> "ДМПП (эндо)", "group_no"=>2, "no"=>7];
        $mass[] = ["group"=> "Коррекция ВПС", "name"=> "ДМЖП (откр)", "group_no"=>2, "no"=>8];
        $mass[] = ["group"=> "Коррекция ВПС", "name"=> "ДМЖП (эндо)", "group_no"=>2, "no"=>9];
        $mass[] = ["group"=> "Коррекция ВПС", "name"=> "Протез АК (мех)", "group_no"=>2, "no"=>10];
        $mass[] = ["group"=> "Коррекция ВПС", "name"=> "Протез АК (биол)", "group_no"=>2, "no"=>11];
        $mass[] = ["group"=> "Коррекция ВПС", "name"=> "Пластика АК", "group_no"=>2, "no"=>12];
        $mass[] = ["group"=> "Коррекция ВПС", "name"=> "Протез МК (мех)", "group_no"=>2, "no"=>13];
        $mass[] = ["group"=> "Коррекция ВПС", "name"=> "Протез МК (биол)", "group_no"=>2, "no"=>14];
        $mass[] = ["group"=> "Коррекция ВПС", "name"=> "Пластика МК", "group_no"=>2, "no"=>15];
        $mass[] = ["group"=> "Коррекция ВПС", "name"=> "Протез ТК (мех)", "group_no"=>2, "no"=>16];
        $mass[] = ["group"=> "Коррекция ВПС", "name"=> "Протез ТК (биол)", "group_no"=>2, "no"=>17];
        $mass[] = ["group"=> "Коррекция ВПС", "name"=> "Пластика ТК", "group_no"=>2, "no"=>18];
        $mass[] = ["group"=> "Коррекция ВПС", "name"=> "Коррекция Тетрада Фалло", "group_no"=>2, "no"=>19];
        $mass[] = ["group"=> "Коррекция ВПС", "name"=> "Коррекция ЧАДЛВ", "group_no"=>2, "no"=>20];
        $mass[] = ["group"=> "Коррекция ВПС", "name"=> "Коррекция ТМА", "group_no"=>2, "no"=>21];
        $mass[] = ["group"=> "Коррекция ВПС", "name"=> "Коррекция АВК", "group_no"=>2, "no"=>22];
        $mass[] = ["group"=> "Коррекция ВПС", "name"=> "Коррекция ЧАВК", "group_no"=>2, "no"=>23];
        $mass[] = ["group"=> "Коррекция ВПС", "name"=> "Коррекция ан. Эбштейна", "group_no"=>2, "no"=>24];
        

        $mass[] = ["group"=> "Коррекция ППС", "name"=> "Протез АК (мех)", "group_no"=>3, "no"=>25];
        $mass[] = ["group"=> "Коррекция ППС", "name"=> "Протез АК (биол)", "group_no"=>3, "no"=>26];
        $mass[] = ["group"=> "Коррекция ППС", "name"=> "Пластика АК", "group_no"=>3, "no"=>27];
        $mass[] = ["group"=> "Коррекция ППС", "name"=> "Протез МК (мех)", "group_no"=>3, "no"=>28];
        $mass[] = ["group"=> "Коррекция ППС", "name"=> "Протез МК (биол)", "group_no"=>3, "no"=>29];
        $mass[] = ["group"=> "Коррекция ППС", "name"=> "Пластика МК", "group_no"=>3, "no"=>30];
        $mass[] = ["group"=> "Коррекция ППС", "name"=> "Протез ТК (мех)", "group_no"=>3, "no"=>31];
        $mass[] = ["group"=> "Коррекция ППС", "name"=> "Протез ТК (биол)", "group_no"=>3, "no"=>32];
        $mass[] = ["group"=> "Коррекция ППС", "name"=> "Пластика ТК", "group_no"=>3, "no"=>33];
        $mass[] = ["group"=> "Коррекция ППС", "name"=> "Протез КЛА", "group_no"=>3, "no"=>34];

        $mass[] = ["group"=> "Коррекция НРС", "name"=> "Лабиринт", "group_no"=>4, "no"=>35];
        $mass[] = ["group"=> "Коррекция НРС", "name"=> "РЧА ПП", "group_no"=>4, "no"=>36];
        $mass[] = ["group"=> "Коррекция НРС", "name"=> "РЧА Прав перешейка", "group_no"=>4, "no"=>37];
        $mass[] = ["group"=> "Коррекция НРС", "name"=> "РЧА ЛП", "group_no"=>4, "no"=>38];
        $mass[] = ["group"=> "Коррекция НРС", "name"=> "РЧА ЛВ", "group_no"=>4, "no"=>39];
        $mass[] = ["group"=> "Коррекция НРС", "name"=> "РЧА ПЖ", "group_no"=>4, "no"=>40];
        $mass[] = ["group"=> "Коррекция НРС", "name"=> "РЧА ЛЖ", "group_no"=>4, "no"=>41];
        $mass[] = ["group"=> "Коррекция НРС", "name"=> "ЭКС-1-камерный", "group_no"=>4, "no"=>42];
        $mass[] = ["group"=> "Коррекция НРС", "name"=> "ЭКС-2-камерный", "group_no"=>4, "no"=>43];
        $mass[] = ["group"=> "Коррекция НРС", "name"=> "ЭКС-3-камерный (БВС)", "group_no"=>4, "no"=>44];

        $mass[] = ["group"=> "Коррекция КМП", "name"=> "Миэктомия", "group_no"=>5, "no"=>45];
        $mass[] = ["group"=> "Коррекция КМП", "name"=> "Перикардэктомия", "group_no"=>5, "no"=>46];

        $mass[] = ["group"=> "Коррекция периферического атеросклероза", "name"=> "Резекция ВСА", "group_no"=>6, "no"=>47];
        $mass[] = ["group"=> "Коррекция периферического атеросклероза", "name"=> "ЭАЭ ВСА", "group_no"=>6, "no"=>48];
        $mass[] = ["group"=> "Коррекция периферического атеросклероза", "name"=> "Стентирование ВСА", "group_no"=>6, "no"=>49];
        $mass[] = ["group"=> "Коррекция периферического атеросклероза", "name"=> "Стентирование артерий НК", "group_no"=>6, "no"=>50];
        $mass[] = ["group"=> "Коррекция периферического атеросклероза", "name"=> "Шунтирование артерий НК", "group_no"=>6, "no"=>51];

        
        $c = count($mass);
        for($i=0;$i<$c;$i++) {
            DB::table('interventions')->insert([
                'group_name' => $mass[$i]['group'],
                'intervention_name' => $mass[$i]['name'],
                'group_no' => $mass[$i]['group_no'],
                'number' => $mass[$i]['no'],
            ]);
        }

    }
}
